src/InformationRegisters/ШаблоныЗаполненияПараметровСценариев/ШаблоныЗаполненияПараметровСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныЗаполненияПараметровСценариев</name>
  <resources>
    <name>ОтносительнаяСсылкаНаМетаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объект</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СпособЗаполнения</name>
    <type>
      <types>EnumRef.СпособыЗаполненияПараметровКоманды</types>
    </type>
  </resources>
  <attributes>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчаствуетВИнтерфейсныхГруппировках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭкземплярСценария</name>
    <type>
      <types>CatalogRef.ЭкземплярыСценариевАвтоматизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыШаговАвтоматизации/ПараметрыШаговАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыШаговАвтоматизации</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ШаблонЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторШага</name>
    <type>
      <types>CatalogRef.ШагиАвтоматизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.КомандыАвтоматизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыГруппировокЕдиницАвтоматизации/ТипыГруппировокЕдиницАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыГруппировокЕдиницАвтоматизации</name>
  <enumValues>
    <name>Нода</name>
  </enumValues>
  <enumValues>
    <name>Кластер</name>
  </enumValues>
  <enumValues>
    <name>Нагрузчики</name>
  </enumValues>
  <enumValues>
    <name>Сервер</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СостоянияСценария/СостоянияСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСценария</name>
  <enumValues>
    <name>НеЗапланирован</name>
  </enumValues>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Стартован</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенУспешно</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенУсловноУспешно</name>
    <comment>Не выполнена успешно часть шагов в блоке вспомогательных шагов</comment>
  </enumValues>
  <enumValues>
    <name>ЗавершенНеуспешно</name>
    <comment>Состояние системы не изменено</comment>
  </enumValues>
  <enumValues>
    <name>ЗавершенФатально</name>
    <comment>Состояние системы  изменено и не восстановлено</comment>
  </enumValues>
  <enumValues>
    <name>Прерван</name>
  </enumValues>
  <enumValues>
    <name>ТестСтартован</name>
  </enumValues>
  <enumValues>
    <name>ТестЗавершенУспешно</name>
  </enumValues>
  <enumValues>
    <name>ТестЗавершенНеуспешно</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеОтката</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыЭлементовСхемыСценария/ТипыЭлементовСхемыСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовСхемыСценария</name>
  <enumValues>
    <name>Ветка</name>
  </enumValues>
  <enumValues>
    <name>ВспомогательныеШаги</name>
    <comment>Шаги из данного блока не влияют на успех сценария, не меняют состояние системы, выполняются как фоновые без учета основного режима выполнения сценария</comment>
  </enumValues>
  <enumValues>
    <name>Шаг</name>
  </enumValues>
  <enumValues>
    <name>Разделение</name>
  </enumValues>
  <enumValues>
    <name>Старт</name>
  </enumValues>
  <enumValues>
    <name>Условие</name>
  </enumValues>
  <enumValues>
    <name>Цикл</name>
  </enumValues>
  <enumValues>
    <name>Вариант</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ГруппыЕдиницАвтоматизации/ГруппыЕдиницАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыЕдиницАвтоматизации</name>
  <attributes>
    <name>ТипГруппы</name>
    <type>
      <types>EnumRef.ТипыГруппировокЕдиницАвтоматизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязкаСОбъектомИБ</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставГруппы</name>
    <attributes>
      <name>ЕдиницаАвтоматизации</name>
      <type>
        <types>CatalogRef.АгентыКИП</types>
      </type>
    </attributes>
    <attributes>
      <name>РольВСценариях</name>
      <type>
        <types>CatalogRef.ШаблоныЕдиницАвтоматизации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ЭкземплярыСценариевАвтоматизации/ЭкземплярыСценариевАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭкземплярыСценариевАвтоматизации</name>
  <owners>Catalog.СценарииАвтоматизации</owners>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтурАвтоматизации</name>
    <type>
      <types>CatalogRef.КонтурыАдминистрирования</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыполнения</name>
    <comment>Предполагает возможность выполнения на одном Агенте нескольких сценариев одновременно</comment>
    <type>
      <types>EnumRef.РежимВыполненияСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапускаТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СопоставлениеШаблоновОборудования</name>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>CatalogRef.ШаблоныЕдиницАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>РеальноеЗначение</name>
      <type>
        <types>CatalogRef.АгентыКИП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ШагиАвтоматизации/ШагиАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШагиАвтоматизации</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЭкземплярыСценариевАвтоматизации</owners>
  <attributes>
    <name>УникальныйИдентификаторШаблонногоШага</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШага</name>
    <type>
      <types>EnumRef.ТипыЭлементовСхемыСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.КомандыАвтоматизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОборудования</name>
    <type>
      <types>CatalogRef.ШаблоныЕдиницАвтоматизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткатываемыйШаг</name>
    <type>
      <types>CatalogRef.ШагиАвтоматизации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/РаботаСоСценариямиАвтоматизацииМассовоеСоздание/Module.bsl
Функция СоздатьСценарийСПараметрами(Единица, ТипЕдиницы, Сценарий, Параметры, ДатаСтарта = Неопределено) Экспорт
	// найдем единицу для сценария
	Если ТипЕдиницы = Перечисления.ТипыГруппировокЕдиницАвтоматизации.Сервер Тогда
		ЕдиницаДляСценария = Справочники.АгентыКИП.НайтиПоНаименованию(Единица);
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ГруппыЕдиницАвтоматизацииСоставГруппы.ЕдиницаАвтоматизации КАК ЕдиницаАвтоматизации,
		                      |	ГруппыЕдиницАвтоматизацииСоставГруппы.РольВСценариях КАК РольВСценариях
		                      |ИЗ
		                      |	Справочник.ГруппыЕдиницАвтоматизации.СоставГруппы КАК ГруппыЕдиницАвтоматизацииСоставГруппы
		                      |ГДЕ
		                      |	ГруппыЕдиницАвтоматизацииСоставГруппы.Ссылка.Наименование = &Наименование
		                      |	И ГруппыЕдиницАвтоматизацииСоставГруппы.Ссылка.ТипГруппы = &ТипГруппы");
		Запрос.УстановитьПараметр("Наименование", Единица);
		Запрос.УстановитьПараметр("ТипГруппы", ТипЕдиницы);
		
		ЕдиницаДляСценария = Запрос.Выполнить().Выгрузить();
		Если ЕдиницаДляСценария.Количество() = 0 Тогда
			ЕдиницаДляСценария = Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЕдиницаДляСценария <> Неопределено Тогда
		// создаем Экземпляр
		Возврат СоздатьНовыйЭкземплярПоВходящимПараметрам(ЕдиницаДляСценария, Сценарий, Параметры, ДатаСтарта)
	КонецЕсли;	
КонецФункции

Функция СоздатьНовыйЭкземплярПоВходящимПараметрам(ЕдиницаДляСценария, Сценарий, ПараметрыЗаполнения, ДатаСтарта, Контур = Неопределено)
	НачатьТранзакцию();
	Попытка
		СоздаваемыйЭкземпляр = Справочники.ЭкземплярыСценариевАвтоматизации.СоздатьЭлемент();
		
		СсылкаНового = Справочники.ЭкземплярыСценариевАвтоматизации.ПолучитьСсылку(Новый УникальныйИдентификатор);
		СоздаваемыйЭкземпляр.УстановитьСсылкуНового(СсылкаНового);
		
		СоздаваемыйЭкземпляр.Владелец = Сценарий;
		СоздаваемыйЭкземпляр.КонтурАвтоматизации = Контур;
		СоздаваемыйЭкземпляр.РежимВыполнения = Сценарий.РежимВыполнения;
		СоздаваемыйЭкземпляр.Состояние = Перечисления.СостоянияСценария.НеЗапланирован;
		СоздаваемыйЭкземпляр.ПлановаяДатаЗапуска = ДатаСтарта;
		
		СоздаваемыйЭкземпляр.ЗаполнитьЭкземплярНаСервере();
		
		// заполним оборудование
		ВыполнитьСопоставлениеОборудованияПоГруппировочнойЕдинице(ЕдиницаДляСценария, СоздаваемыйЭкземпляр.СопоставлениеШаблоновОборудования);
		
		ШагиАвтоматизации = Справочники.ШагиАвтоматизации.Выбрать(, СсылкаНового, Новый Структура("ТипШага", Перечисления.ТипыЭлементовСхемыСценария.Шаг));
		Пока ШагиАвтоматизации.Следующий() Цикл
			НайденнаяСтрока = СоздаваемыйЭкземпляр.СопоставлениеШаблоновОборудования.Найти(ШагиАвтоматизации.ШаблонОборудования);
			Если НайденнаяСтрока <> Неопределено Тогда
				ОбъектШаг = ШагиАвтоматизации.ПолучитьОбъект();
				ОбъектШаг.Оборудование = НайденнаяСтрока.РеальноеЗначение;
				ОбъектШаг.Записать();
			КонецЕсли;
		КонецЦикла;	
		
		// перезаполним значения шаблонов из параметров
		Для Каждого Параметр Из ПараметрыЗаполнения Цикл
			НЗ = РегистрыСведений.ШаблоныЗаполненияПараметровСценариев.СоздатьНаборЗаписей();
			НЗ.Отбор.ЭкземплярСценария.Установить(СсылкаНового);
			НЗ.Отбор.ИмяШаблона.Установить(ВРег(Параметр.Ключ));
			НЗ.Прочитать();
			Если НЗ.Количество() > 0 Тогда
				Для Каждого Запись Из НЗ Цикл
					Запись.Значение = Параметр.Значение;
					Запись.Объект = Новый ХранилищеЗначения(Параметр.Значение);
				КонецЦикла;	
				НЗ.Записать();
			КонецЕсли;
		КонецЦикла;
		
		НЗ = РегистрыСведений.ШаблоныЗаполненияПараметровСценариев.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭкземплярСценария.Установить(СсылкаНового);
		НЗ.Прочитать();
		
		ВыгрузкаШаблонов = НЗ.Выгрузить();
		
		МассивТипов = Справочники.ТипВсеСсылки().Типы();
		МассивТипов.Добавить(Тип("Строка"));
		
		ВыгрузкаШаблонов.Колонки.Добавить("ОбъектВыгруженный", Новый ОписаниеТипов(МассивТипов));
		Для каждого Строка Из ВыгрузкаШаблонов Цикл
			Строка.ОбъектВыгруженный = Строка.Объект.Получить();
		КонецЦикла;	
				
		Запрос = РаботаСоСценариямиАвтоматизацииСервер.ПолучитьЗапросДляОбработкиВложенныхПараметров(ВыгрузкаШаблонов, "ОбъектВыгруженный");
		
		ВыборкаВерхнегоУровня = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаВерхнегоУровня.Следующий() Цикл
			ВыборкаВложенных  = ВыборкаВерхнегоУровня.Выбрать();
			СтроковыйПараметр = "";
			Пока ВыборкаВложенных.Следующий() Цикл
				Если СтроковыйПараметр = "" Тогда
					СтроковыйПараметр = ВыборкаВложенных.Объект;
				КонецЕсли;	
				СтроковыйПараметр = СтрЗаменить(СтроковыйПараметр, ВыборкаВложенных.ИмяШаблонаВложенного, ВыборкаВложенных.ЗначениеВложенного);
			КонецЦикла;	
			
			НЗ = РегистрыСведений.ШаблоныЗаполненияПараметровСценариев.СоздатьНаборЗаписей();
			НЗ.Отбор.ЭкземплярСценария.Установить(СсылкаНового);
			НЗ.Отбор.ИмяШаблона.Установить(ВыборкаВерхнегоУровня.ИмяШаблона);
			НЗ.Прочитать();
			
			Для Каждого Запись Из НЗ Цикл
				Запись.Значение = СтроковыйПараметр;
			КонецЦикла;
			
			НЗ.Записать();

		КонецЦикла;	
			
		ТаблицаШаблонов = НЗ.Выгрузить();
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Таб.Значение КАК Значение,
		                      |	Таб.ИмяШаблона КАК Шаблон
		                      |ПОМЕСТИТЬ ТабЛицаШаблонов
		                      |ИЗ
		                      |	&ТабЛицаШаблонов КАК Таб
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ПараметрыШаговАвтоматизации.ИдентификаторШага КАК ИдентификаторШага,
		                      |	ПараметрыШаговАвтоматизации.Команда КАК Команда,
		                      |	ПараметрыШаговАвтоматизации.Параметр КАК Параметр,
		                      |	ТабЛицаШаблонов.Значение КАК Значение,
		                      |	ПараметрыШаговАвтоматизации.ШаблонЗаполнения КАК ШаблонЗаполнения
		                      |ИЗ
		                      |	РегистрСведений.ПараметрыШаговАвтоматизации КАК ПараметрыШаговАвтоматизации
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабЛицаШаблонов КАК ТабЛицаШаблонов
		                      |		ПО (ПараметрыШаговАвтоматизации.ИдентификаторШага.Владелец = &Владелец)
		                      |			И ПараметрыШаговАвтоматизации.ШаблонЗаполнения = ТабЛицаШаблонов.Шаблон
		                      |			И ПараметрыШаговАвтоматизации.Значение <> ТабЛицаШаблонов.Значение
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |УНИЧТОЖИТЬ ТабЛицаШаблонов");
		Запрос.УстановитьПараметр("ТабЛицаШаблонов", ТаблицаШаблонов);
		Запрос.УстановитьПараметр("Владелец", СсылкаНового);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НЗ = РегистрыСведений.ПараметрыШаговАвтоматизации.СоздатьНаборЗаписей();
			НЗ.Отбор.ИдентификаторШага.Установить(Выборка.ИдентификаторШага);
			НЗ.Отбор.Команда.Установить(Выборка.Команда);
			НЗ.Отбор.Параметр.Установить(Выборка.Параметр);
			Запись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			НЗ.Записать();
		КонецЦикла;	
		
		СоздаваемыйЭкземпляр.СформироватьНаименованиеНаСервере();
		
		СоздаваемыйЭкземпляр.Записать();

		ЗафиксироватьТранзакцию();
		
		Возврат СоздаваемыйЭкземпляр.Ссылка;
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Копирование сценария'", Метаданные.ОсновнойЯзык.КодЯзыка), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;		
	КонецПопытки;	
КонецФункции	

Процедура ВыполнитьСопоставлениеОборудованияПоГруппировочнойЕдинице(ЕдиницаДляСценария, ТаблицаДляЗаполнения) Экспорт
	Если ТипЗнч(ЕдиницаДляСценария) = Тип("СправочникСсылка.АгентыКИП") Тогда
		Для Каждого Строка Из ТаблицаДляЗаполнения Цикл
			Строка.РеальноеЗначение = ЕдиницаДляСценария;
		КонецЦикла;	
	Иначе
		Для каждого Строка Из ЕдиницаДляСценария Цикл
			НайденныеСтроки = ТаблицаДляЗаполнения.НайтиСтроки(Новый Структура( "Шаблон", Строка.РольВСценариях));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.РеальноеЗначение = Строка.ЕдиницаАвтоматизации;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
